/**
 * Created with IntelliJ IDEA.
 * User: fudongguang
 * Date: 13-8-30
 * Time: PM2:04
 * To change this template use File | Settings | File Templates.
 */


define(['../global/global'],function(g){
    return {
        /**
         * 获取推广链接
         */
        customData:[
            ['东直门','国贸','特拉斯',7.5,30,52,45,7],
            ['国贸','首都机场','特拉斯',25,45,147,45,24,23],
            ['首都机场','东直门','特拉斯',22,35,129,45,21,8,5],


            ['东直门','国贸','豪华车型',7.5,30,68,30,38],
            ['国贸','首都机场','豪华车型',25,45,298,298],
            ['首都机场','东直门','豪华车型',22,35,298,298],


            ['东直门','国贸','商务车型',7.5,30,55,25,30],
            ['国贸','首都机场','商务车型',25,45,198,198],
            ['首都机场','东直门','商务车型',22,35,198,198],


            ['东直门','国贸','舒适车型',7.5,30,43,20,23],
            ['国贸','首都机场','舒适车型',25,45,138,138],
            ['首都机场','东直门','舒适车型',22,35,158,158],

            ['东直门','国贸','经济车型',7.5,30,34,15,19],
            ['国贸','首都机场','经济车型',25,45,98,98],
            ['首都机场','东直门','经济车型',22,35,118,118]

        ],

        getPrice:function(from,car){
            if(!from || !car){
                return false;
            }


            var i= 0,
                result,
                p = this.customData;
            for(;i< p.length;i++){
                if(p[i][0]===from && p[i][2]===car){
                    result = p[i];
                    break;
                }
            }

            for(i=0;i<12;i++){
                if(!result[i]){
                    result[i]=0;
                }
            }

            return result;
        }
    }
});